In [87]:
print('Ready to begin !')

Ready to begin !

In [103]:
import pandas as pd 
df= pd.DataFrame({'Roomies':['Ethan', 'James', 'Dom', 'Nick'],
                  'Age': [24, 25, 27, 29]})
df

  Roomies  Age
0   Ethan   24
1   James   25
2     Dom   27
3    Nick   29

In [104]:
df['Age'].dtype

dtype('int64')

In [105]:
# Regular maths operations on series

ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
print(ds1,'\n',ds2)
ds = ds1 + ds2
print("Add two Series:")
print(ds)
print("Subtract two Series:")
ds = ds1 - ds2
print(ds)
print("Multiply two Series:")
ds = ds1 * ds2
print(ds)
print("Divide Series1 by Series2:")
ds = ds1 / ds2
print(ds)

0     2
1     4
2     6
3     8
4    10
dtype: int64
 0    1
1    3
2    5
3    7
4    9
dtype: int64
Add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiply two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divide Series1 by Series2:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [106]:
df['Proffession'] =['AI Developer', 'Design Engineer', 'Data Engineer', 'Finance Analyst']

In [107]:
df

  Roomies  Age      Proffession
0   Ethan   24     AI Developer
1   James   25  Design Engineer
2     Dom   27    Data Engineer
3    Nick   29  Finance Analyst

In [108]:
df.loc[len(df)] = ['Mike', 22, 'Freelancer']
df = df.sort_values(by='Age')

df = df.drop_duplicates()
df

  Roomies  Age      Proffession
4    Mike   22       Freelancer
0   Ethan   24     AI Developer
1   James   25  Design Engineer
2     Dom   27    Data Engineer
3    Nick   29  Finance Analyst

In [109]:
# Making series from a dataframe

a1 = df.iloc[:, 2]
a1

4         Freelancer
0       AI Developer
1    Design Engineer
2      Data Engineer
3    Finance Analyst
Name: Proffession, dtype: object

In [110]:
# Array of column values 

a1.values

array(['Freelancer', 'AI Developer', 'Design Engineer', 'Data Engineer',
       'Finance Analyst'], dtype=object)

In [111]:
# Array of a column values with condition 

a2 = pd.Series(df.iloc[:, 1])

arr = a2[a2 <= 25]
print(arr.to_list())

[22, 24, 25]

In [121]:
print(a2.to_list())
print('Mean : ', a2.mean())
print('mode : ', a2.mode()[0])
print('median : ', a2.median())
print('standard deviation : ', a2.std().round(2))
print('standard deviation : ', '{:.2f}'.format(a2.std()))

[22, 24, 25, 27, 29]
Mean :  25.4
mode :  22
median :  25.0
standard deviation :  2.7
standard deviation :  2.70

In [122]:
df[['Roomies','Age']]

  Roomies  Age
4    Mike   22
0   Ethan   24
1   James   25
2     Dom   27
3    Nick   29

In [132]:
# Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
import numpy as np 
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df1 = pd.DataFrame(exam_data,index=labels)
print(df1.iloc[[1, 3, 5, 6],[0,1,3]])

      name  score qualify
b     Dima    9.0      no
d    James    NaN      no
f  Michael   20.0     yes
g  Matthew   14.5     yes

In [133]:
# Select the rows where the number of attempts in the examination is greater than 2.

exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempt' : [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df1= pd.DataFrame(exam_data, index=labels)
print(df1[df1['attempt'] > 2])

      name  score  attempt qualify
b     Dima    9.0        3      no
d    James    NaN        3      no
f  Michael   20.0        3     yes

In [136]:
# Select the rows where the score is missing.

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df1 = pd.DataFrame(exam_data, index=labels)
print(df1[df1['score'].isnull()])

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [140]:
# Select the rows the score is between 15 and 20 (inclusive).

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df1 = pd.DataFrame(exam_data, index=labels)
print(df1[df1['score'].between(15,20)])

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [146]:
df = df.rename(columns={'Name':'Roomies'})
df.columns.to_list()

['Roomies', 'Age', 'Proffession']

In [152]:
# Adding new column

df['Mobile'] = ['Samsung', 'Poco', 'Samsung', 'Iphone', 'Realme'] 
df

  Roomies  Age      Proffession   Mobile
4    Mike   22       Freelancer  Samsung
0   Ethan   24     AI Developer     Poco
1   James   25  Design Engineer  Samsung
2     Dom   27    Data Engineer   Iphone
3    Nick   29  Finance Analyst   Realme

In [160]:
# Iterating through each riw 
for index, row in df.iterrows():
    print(row['Age'], row['Proffession'])

22 Freelancer
24 AI Developer
25 Design Engineer
27 Data Engineer
29 Finance Analyst

In [163]:
# Chaning column order
print(df,'\n')
print(df[['Proffession', 'Age', 'Mobile', 'Roomies']])

  Roomies  Age      Proffession   Mobile
4    Mike   22       Freelancer  Samsung
0   Ethan   24     AI Developer     Poco
1   James   25  Design Engineer  Samsung
2     Dom   27    Data Engineer   Iphone
3    Nick   29  Finance Analyst   Realme

       Proffession  Age   Mobile Roomies
4       Freelancer   22  Samsung    Mike
0     AI Developer   24     Poco   Ethan
1  Design Engineer   25  Samsung   James
2    Data Engineer   27   Iphone     Dom
3  Finance Analyst   29   Realme    Nick

In [168]:
# rows with specific column values

print(df.loc[df['Mobile'] == 'Samsung'])

  Roomies  Age      Proffession   Mobile
4    Mike   22       Freelancer  Samsung
1   James   25  Design Engineer  Samsung